Ran Plan for project: `securitygroup/zerone-id/tmcd_apnortheast2` dir: `terraform/securitygroup/zerone-id/tmcd_apnortheast2` workspace: `default`

<details><summary>Show Output</summary>

```diff
data.terraform_remote_state.vpc: Reading...
data.terraform_remote_state.vpc: Read complete after 0s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_security_group.codebuild_deployment will be created
+ resource "aws_security_group" "codebuild_deployment" {
      + arn                    = (known after apply)
      + description            = "codebuild-deployment secrutiy group for tmcd_apnortheast2"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "any outbound"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "codebuild-deployment-tmcd_apnortheast2"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-02bd27f3ad9337b18"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ codebuild_deployment_id = (known after apply)

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p securitygroup/zerone-id/tmcd_apnortheast2`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.terraform.devart.tv/lock?id=DevopsArtFactory%252Fterraform-provisioning%252Fterraform%252Fsecuritygroup%252Fzerone-id%252Ftmcd_apnortheast2%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p securitygroup/zerone-id/tmcd_apnortheast2`
</details>
Plan: 1 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
